Revit 2027 API
PerformanceAdviser.GetRuleName(Int32) Method
 Retrieves the name of the rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetRuleName(
	int index
)
Public Function GetRuleName (
	index As Integer
) As String
public:
String^ GetRuleName(
	int index
)
member GetRuleName :
        index : int -> string
Parameters
index Int32
 The rule index to get information for.
Return Value
String
 The name of the rule.
See Also
Reference
PerformanceAdviser Class
GetRuleName Overload
Autodesk.Revit.DB Namespace